{
  "game_info": {
    "body": "<p>History of the series. A spin-off? What do you mean?</p\n<p>Yes, this is a spin-off of an old game from the same author, myself.  ; )</p\n\n<p>Original Pac's Revenge (1987-88); ahead of its time story:</p\n\n<p>In a world where humanity has expanded for several planets of the nearby galaxies, there is an environmental menace about to explode.\nThis menace would have catastrophic consequences for the settlements in the Systems of Draco II, Hydrus I, and the very Milky Way.</p\n\n<p>When the United Federation of Planets (UFEP) detected the worst environmental probe results in several years, they were not taken by surprise. They thought they knew who was behind all this, but they could not prove it just then.</p\n\n<p>Some weeks ago, all communications from the Negasus System were stopped. So, the UFEP cannot be sure if its government and leader is still the same, that is, Tetsuo Yagami.</p\n<p>Given the seriousness of this crisis, the UFEP send their best scientific secret agent to find out what is going on in the Negasus System, to collect evidence of transgressions of the UFEP laws, and to minimize the environmental crisis if possible by reducing radiation waste.</p\n\n<p>Pac's Revenge had two parts, that I called phases:</p\n<p>Part 1 of Pac's Revenge:</p\n<p>Pac travels with his spaceship to the Negasus System. Soon he discovers that entering the Negasus System will not be easy, because of the barriers and traps surrounding it.\nBut finally, he beats the Negasus exo-defences and arrives at Orus, the most industrialized planet of the Negasus System where its government lies.</p\n\n<p>Part 2 of Pac's Revenge:</p\n<p>Pac lands his spaceship on the outskirts of the planet.\nHe takes his anti-radiation briefcase and enters what clearly is a very industrialized land.\nThe platformer part of Pac's Revenge game started this way. Pac with his special briefcase starts to collect all the radioactive batteries that he can find while bypassing the security defenses and traps.\nIn the platformer part of the original game, our protagonist did not have any weapon, he just could dodge the industrial machines and robots that he encounters. A lot of industrial robots make this difficult, but finally, Pac arrives at the government offices.\n<p>There, he discovers that the country's government has been transformed into a dictatorship at the hands of a tyrant who calls himself Great Emperor Tetsuo.\nTetsuo's motivation seems to be acquiring power and money to attract cute young women. The fact that G.E. Tetsuo receives him sitting on a throne that is actually a toilet makes Pac suspect that he has to deal with a madman.</p\n<p>Someway, Pac must come back to de UFEP headquarters with the batteries he has recovered, and prove what is happening in the Negasus Imperial Planet.</p\n<p>Finally, Pac beats Tetsuo escaping from Negasus and completing his mission.</p\n\n<p>What made Pac's Revenge an interesting game was dealing with philosophical and political issues in a futuristic world: environmental contamination, techno-ultra-liberal government despotism, sexual exploitation, and social isolation. Well, in fact, there was no other character in the game, so it had no woman on it.</p\n\n<p>The CodeMaster. Nightmare on Bots' Island ...</p\n<p>* Takes place some years later. \n* Pac is considered a hero at the headquarters of the UFEP.\n* Pac now has a girlfriend, Kaede, to whom he wants to propose (he met her in Pac's Revenge 2).\n* For this reason he travels to the kingdom where Kaede's father, Kaito, rules, but something there is wrong.\n* Questions you will not get an answer from this demo:\n    * Will Pac get Kaede's hand from her father?\n    * What is really happening in Kaito's kingdom? \n    * Who is the CodeMaster and what does he have to do with all this?</p"
  }
}
